countries/app/controllers/home_controller.rb

SELECT id, abbreviation, name, north_america FROM "countries"
---
  def index
    @countries = Country.select([:id, :abbreviation, :name, :north_america])

SELECT id, abbreviation, name, north_america FROM "countries" LIMIT 0 OFFSET 0
---
  def countries
    step = params[:step] || 5
    offset = params[:offset] || 0
    @countries = Country.select([:id, :abbreviation, :name, :north_america]).limit(step.to_i).offset(offset.to_i)